//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2017, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093         **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
## @file SdioSetup.uni
#   This is SdioSetup uni file
##

//---------------------------------------------------------------------------

#include "VFR.uni"

//---------------------------------------------------------------------------

#langdef   x-AMI "x-AMI"    // AMI Configuration Language

#string STR_SDIO_CONFIGURATION          #language eng "SDIO Configuration"
#string STR_SDIO_CONFIGURATION_HELP     #language eng "SDIO Configuration Parameters"
#string STR_SDIO_DEVICE1                #language eng ""
                                        #language x-AMI "SDIO000"
#string STR_SDIO_DEVICE2                #language eng ""
                                        #language x-AMI "SDIO001"
#string STR_SDIO_DEVICE3                #language eng ""
                                        #language x-AMI "SDIO002"
#string STR_SDIO_DEVICE4                #language eng ""
                                        #language x-AMI "SDIO003"
#string STR_SDIO_DEVICE5                #language eng ""
                                        #language x-AMI "SDIO004"
#string STR_SDIO_DEVICE6                #language eng ""
                                        #language x-AMI "SDIO005"
#string STR_SDIO_DEVICE7                #language eng ""
                                        #language x-AMI "SDIO006"
#string STR_SDIO_DEVICE8                #language eng ""
                                        #language x-AMI "SDIO007"

#string STR_SDIO_DEVICE1_LOCATION       #language eng ""
#string STR_SDIO_DEVICE2_LOCATION       #language eng ""
#string STR_SDIO_DEVICE3_LOCATION       #language eng ""
#string STR_SDIO_DEVICE4_LOCATION       #language eng ""
#string STR_SDIO_DEVICE5_LOCATION       #language eng ""
#string STR_SDIO_DEVICE6_LOCATION       #language eng ""
#string STR_SDIO_DEVICE7_LOCATION       #language eng ""
#string STR_SDIO_DEVICE8_LOCATION       #language eng ""
#string STR_IO_DEVICE1_DETAILS          #language eng ""
#string STR_IO_DEVICE2_DETAILS          #language eng ""
#string STR_IO_DEVICE3_DETAILS          #language eng ""
#string STR_IO_DEVICE4_DETAILS          #language eng ""
#string STR_IO_DEVICE5_DETAILS          #language eng ""
#string STR_IO_DEVICE6_DETAILS          #language eng ""
#string STR_IO_DEVICE7_DETAILS          #language eng ""
#string STR_IO_DEVICE8_DETAILS          #language eng ""
#string STR_SDIO_DEVICES                #language eng "SDIO Devices:"
#string STR_SDIO_MODE                   #language eng "SDIO Access Mode"
                                        #language x-AMI "SDIO008"
#string STR_SDIO_MODE_HELP              #language eng "Auto Option: Access SD device in DMA mode if controller supports it,otherwise in PIO mode.DMA Option: Access SD device in DMA mode.PIO Option: Access SD device in PIO mode."
#string STR_SDIO_AUTO                   #language eng "Auto"
#string STR_SDIO_ADMA                   #language eng "ADMA"
#string STR_SDIO_SDMA                   #language eng "SDMA"
#string STR_SDIO_PIO                    #language eng "PIO"
#string STR_SDIO_EMULATION              #language eng "Mass Storage Devices:"
#string STR_SDIO_EMULATION_TYPE_HELP    #language eng "Mass storage device emulation type. 'AUTO' enumerates devices less than 530MB as floppies. Forced FDD option can be used to force HDD formatted drive to boot as FDD."
#string STR_SDIO_AUTO                   #language eng "Auto"
#string STR_SDIO_EMUL_FLOPPY            #language eng "Floppy"
#string STR_SDIO_EMUL_FORCED_FDD        #language eng "Forced FDD"
#string STR_SDIO_EMUL_HDD               #language eng "Hard Disk"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2017, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093         **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************